Revit 2027 API
EffectInstance.SetTransparency Method
 Sets the transparency parameter of the effect instance.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetTransparency(
	double transparency
)
Public Sub SetTransparency (
	transparency As Double
)
public:
void SetTransparency(
	double transparency
)
member SetTransparency :
        transparency : float -> unit
Parameters
transparency Double
 The transparency value.
See Also
Reference
EffectInstance Class
Autodesk.Revit.DB.DirectContext3D Namespace